Revit 2024 API
MacroModule.GetEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual IEnumerator<Macro> GetEnumerator()
Visual Basic
Public Overridable Function GetEnumerator As IEnumerator(Of Macro)
Visual C++
public:
virtual IEnumerator<Macro^>^ GetEnumerator()
Return Value
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
MacroModule Class
Autodesk.Revit.DB.Macros Namespace